In [48]:
import pandas as pd
import numpy as np

In [49]:
a = pd.Series([4,7,6,3,9])

In [50]:
a

0    4
1    7
2    6
3    3
4    9
dtype: int64

In [51]:
a

0    4
1    7
2    6
3    3
4    9
dtype: int64

In [52]:
a.index

RangeIndex(start=0, stop=5, step=1)

In [53]:
a.values

array([4, 7, 6, 3, 9], dtype=int64)

In [54]:
df = pd.DataFrame({
    'Age': [46, 37, 44, 42, 42],
    'Country': ['Spain', 'Spain', 'Germany', 'Germany', 'France'],
    'Gender': ['Female', 'Female', 'Male', 'Male', 'Male']
})

In [55]:
df

   Age  Country  Gender
0   46    Spain  Female
1   37    Spain  Female
2   44  Germany    Male
3   42  Germany    Male
4   42   France    Male

In [56]:
df.Age

0    46
1    37
2    44
3    42
4    42
Name: Age, dtype: int64

In [57]:
df[['Country', 'Age']]

   Country  Age
0    Spain   46
1    Spain   37
2  Germany   44
3  Germany   42
4   France   42

In [58]:
df.columns

Index(['Age', 'Country', 'Gender'], dtype='object')

In [59]:
df.index = [101, 102, 103, 104, 105]

In [60]:
df

     Age  Country  Gender
101   46    Spain  Female
102   37    Spain  Female
103   44  Germany    Male
104   42  Germany    Male
105   42   France    Male

In [104]:
#df = pd.read_csv('c:/1/Churn_Modelling.csv')
df = pd.read_csv('./Churn_Modelling.csv')
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [105]:
df.tail(2)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [63]:
df.sample()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
5784,5785,15738063,Shen,631,France,Male,29,2,0.0,2,1,1,18581.84,0

In [64]:
df.sample(frac=0.0005)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
8402,8403,15766683,Coombes,549,Germany,Male,36,6,139422.37,1,0,0,83983.39,1
5397,5398,15638513,Palermo,723,France,Female,40,7,142856.95,2,0,0,38019.74,0
4917,4918,15681991,Walsh,542,France,Male,32,7,107871.72,1,1,0,125302.64,0
994,995,15623521,Sozonov,838,Spain,Male,43,9,123105.88,2,1,0,145765.83,0
4933,4934,15787597,Hsu,420,Germany,Female,31,1,108377.75,2,1,1,9904.63,0

In [65]:
df.shape

(10000, 14)

In [66]:
%%time
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB
CPU times: total: 0 ns
Wall time: 15.6 ms

In [102]:
df.describe(include=['object'])

       Surname Geography Gender
count    10000     10000  10000
unique    2932         3      2
top      Smith    France   Male
freq        32      5014   5457

In [68]:
type(df)

pandas.core.frame.DataFrame

In [69]:
7+ df[['Age']].min()**2

Age    331
dtype: int64

In [70]:
df['Age'].min()**2

324

In [71]:
df.describe(include=['object'])

       Surname Geography Gender
count    10000     10000  10000
unique    2932         3      2
top      Smith    France   Male
freq        32      5014   5457

In [72]:
df.describe(include=['object'])

       Surname Geography Gender
count    10000     10000  10000
unique    2932         3      2
top      Smith    France   Male
freq        32      5014   5457

In [73]:
df.dtypes

RowNumber            int64
CustomerId           int64
Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object

In [74]:
df['HasCrCard'].astype('bool')

0        True
1       False
2        True
3       False
4        True
        ...
9995     True
9996     True
9997    False
9998     True
9999     True
Name: HasCrCard, Length: 10000, dtype: bool

In [75]:
df['HasCrCard'] = df['HasCrCard'].astype('bool')

In [76]:
df['HasCrCard'].dtype

dtype('bool')

In [77]:
df['Geography'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [78]:
df[['Geography']].nunique()

Geography    3
dtype: int64

In [79]:
df['Geography'].value_counts()

France     5014
Germany    2509
Spain      2477
Name: Geography, dtype: int64

In [80]:
df['Geography'].value_counts(normalize=True)

France     0.5014
Germany    0.2509
Spain      0.2477
Name: Geography, dtype: float64

In [81]:
df['Geography'].value_counts()

France     5014
Germany    2509
Spain      2477
Name: Geography, dtype: int64

In [82]:
df['Gender'] == 'Male'

0       False
1       False
2       False
3       False
4       False
        ...
9995     True
9996     True
9997    False
9998     True
9999    False
Name: Gender, Length: 10000, dtype: bool

In [83]:
male = df[df['Gender'] == 'Male']

In [84]:
male

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
5,6,15574012,Chu,645,Spain,Male,44,8,113755.78,2,True,0,149756.71,1
6,7,15592531,Bartlett,822,France,Male,50,7,0.00,2,True,1,10062.80,0
8,9,15792365,He,501,France,Male,44,4,142051.07,2,False,1,74940.50,0
9,10,15592389,H?,684,France,Male,27,2,134603.88,1,True,1,71725.73,0
10,11,15767821,Bearce,528,France,Male,31,6,102016.72,2,False,0,80181.12,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9992,9993,15657105,Chukwualuka,726,Spain,Male,36,2,0.00,1,True,0,195192.40,0
9993,9994,15569266,Rahman,644,France,Male,28,7,155060.41,1,True,0,29179.52,0
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,True,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,True,1,101699.77,0
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,True,0,92888.52,1

In [85]:
df[(df['Gender'] == 'Female') & (df['Age'] <= 19)]

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
923,924,15601026,Gallagher,572,Germany,Female,19,1,138657.08,1,True,1,16161.82,0
1678,1679,15569178,Kharlamov,570,France,Female,18,4,82767.42,1,True,0,71811.90,0
2021,2022,15795519,Vasiliev,716,Germany,Female,18,3,128743.80,1,False,0,197322.13,0
2669,2670,15693947,Tokareva,614,France,Female,19,5,97445.49,2,True,0,122823.34,0
3239,3240,15776844,Hao,762,Spain,Female,19,6,0.00,2,True,0,55500.17,0
3295,3296,15654296,Estrada,754,Spain,Female,19,9,0.00,1,True,0,189641.11,0
4218,4219,15782418,Ku,589,Germany,Female,19,9,83495.11,1,True,1,143022.31,1
4330,4331,15666652,Anayolisa,781,France,Female,19,3,0.00,2,True,1,124297.32,0
4556,4557,15796231,Nwankwo,681,France,Female,18,1,98894.39,1,True,1,9596.40,0
4727,4728,15641822,Barese,648,France,Female,19,1,0.00,2,False,1,22101.86,0
6319,6320,15768340,Beavers,642,Germany,Female,19,3,113905.48,1,True,1,176137.20,0
8786,8787,15770968,Leason,741,Germany,Female,19,8,108711.57,2,True,0,24857.25,0
9520,9521,15673180,Onyekaozulu,727,Germany,Female,18,2,93816.70,2,True,0,126172.11,0

In [86]:
df[(df['HasCrCard']) & (df['NumOfProducts'] >= 4)]

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
7,8,15656148,Obinna,376,Germany,Female,29,4,115046.74,4,True,0,119346.88,1
70,71,15703793,Konovalova,738,Germany,Male,58,2,133745.44,4,True,0,28373.86,1
1254,1255,15610383,Dumetolisa,628,France,Female,46,1,46870.43,4,True,0,31272.14,1
1488,1489,15625824,Kornilova,596,Spain,Male,30,6,121345.88,4,True,0,41921.75,1
1701,1702,15605279,Francis,792,France,Male,50,9,0.00,4,True,1,194700.81,1
2196,2197,15791700,Ugochukwutubelum,773,Germany,Male,47,2,118079.47,4,True,1,143007.49,1
2285,2286,15783615,Ramos,630,Germany,Male,50,3,129370.91,4,True,1,47775.34,1
2462,2463,15704442,Fleming,672,France,Female,53,9,169406.33,4,True,1,147311.47,1
2509,2510,15689341,Gibbs,655,France,Female,50,10,0.00,4,True,0,179267.94,1
2614,2615,15640846,Chibueze,546,Germany,Female,58,3,106458.31,4,True,0,128881.87,1
2872,2873,15671591,Castiglione,439,Spain,Male,52,3,96196.24,4,True,0,198874.52,1
3152,3153,15724161,Sutton,644,France,Female,40,9,137285.26,4,True,0,77063.63,1
3365,3366,15764431,Chinwenma,671,Spain,Female,34,5,130929.02,4,True,1,28238.25,1
3841,3842,15750778,Ponomarev,653,France,Female,60,2,120731.39,4,True,1,138160.11,1
4014,4015,15597914,Evdokimov,641,Germany,Female,51,2,117306.69,4,True,1,26912.72,1
4166,4167,15654562,Ma,850,Spain,Female,45,5,174088.30,4,True,0,5669.31,1
4403,4404,15616859,Bonwick,602,Germany,Female,43,2,113641.49,4,True,0,115116.35,1
4511,4512,15568006,Ukaegbunam,634,France,Female,45,2,0.00,4,True,0,101039.53,1
4516,4517,15812210,Yashina,497,Germany,Female,32,8,111537.23,4,True,1,9497.99,1
4606,4607,15784958,Allan,797,France,Female,55,10,0.00,4,True,1,49418.87,1
4748,4749,15759067,Bromby,537,Germany,Female,37,7,158411.95,4,True,1,117690.58,1
5010,5011,15719508,Davis,575,Germany,Male,49,7,121205.15,4,True,1,168080.53,1
5137,5138,15601594,Ifeanacho,698,France,Female,51,6,144237.91,4,True,0,157143.61,1
5235,5236,15608528,Munro,645,France,Female,68,9,0.00,4,True,1,176353.87,1
5700,5701,15812888,Perreault,447,France,Male,41,3,0.00,4,True,1,197490.39,1
5904,5905,15664270,Balsillie,692,Germany,Male,45,6,142084.04,4,True,0,188305.85,1
6150,6151,15625761,Maclean,632,Germany,Male,41,8,127205.32,4,True,0,93874.87,1
6172,6173,15656822,Day,568,Germany,Male,43,5,87612.64,4,True,1,107155.40,1
6279,6280,15608338,Chiemenam,757,Spain,Female,55,9,117294.12,4,True,0,94187.47,1
7457,7458,15668889,Galgano,665,Germany,Female,43,2,116322.27,4,True,0,35640.12,1
7698,7699,15691513,Dawkins,592,France,Male,60,9,0.00,4,True,1,13614.01,1
7729,7730,15681007,Yen,850,France,Female,35,2,128548.49,4,True,0,75478.95,1
8041,8042,15701439,Fanucci,698,Spain,Female,50,1,0.00,4,True,0,88566.90,1
8590,8591,15633194,Osborne,771,France,Female,41,10,108309.00,4,True,1,137510.41,1
8850,8851,15590201,Fiorentini,500,Spain,Female,50,5,0.00,4,True,1,83866.35,1
9215,9216,15624180,Genovesi,584,Germany,Female,37,10,134171.80,4,True,1,70927.11,1
9255,9256,15622033,Rapuluchukwu,847,Germany,Female,41,3,101543.51,4,True,0,16025.17,1
9323,9324,15815316,Kennedy,644,France,Male,50,9,76817.00,4,True,0,196371.13,1
9411,9412,15796115,Forbes,689,Germany,Female,40,4,78119.59,4,True,0,119259.34,1
9540,9541,15634551,Williamson,727,Germany,Male,46,3,115248.11,4,True,0,130752.01,1
9565,9566,15752294,Long,582,France,Female,38,9,135979.01,4,True,1,76582.95,1

In [87]:
df[~(df['Geography'] != 'Spain')]

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,False,1,112542.58,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,True,1,79084.10,0
5,6,15574012,Chu,645,Spain,Male,44,8,113755.78,2,True,0,149756.71,1
11,12,15737173,Andrews,497,Spain,Male,24,3,0.00,2,True,0,76390.01,0
14,15,15600882,Scott,635,Spain,Female,35,7,0.00,2,True,1,65951.65,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9966,9967,15590213,Ch'en,479,Spain,Male,35,4,125920.98,1,True,1,20393.44,0
9980,9981,15719276,T'ao,741,Spain,Male,35,6,74371.49,1,False,0,99595.67,0
9987,9988,15588839,Mancini,606,Spain,Male,30,8,180307.73,2,True,1,1914.41,0
9989,9990,15605622,McMillan,841,Spain,Male,28,4,0.00,2,True,1,179436.60,0
9992,9993,15657105,Chukwualuka,726,Spain,Male,36,2,0.00,1,True,0,195192.40,0

In [88]:
df[df['Geography'].isin(['France'])]

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,True,1,101348.88,1
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,True,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,False,0,93826.63,0
6,7,15592531,Bartlett,822,France,Male,50,7,0.00,2,True,1,10062.80,0
8,9,15792365,He,501,France,Male,44,4,142051.07,2,False,1,74940.50,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,9995,15719294,Wood,800,France,Female,29,2,0.00,2,False,0,167773.55,0
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,True,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,True,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,False,1,42085.58,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,True,0,38190.78,0

In [89]:
df_small = df[(df['Geography'] == 'Spain')][['Geography', 'Gender', 'Age']]

In [90]:
df_small.head(n=20000)

     Geography  Gender  Age
1        Spain  Female   41
4        Spain  Female   43
5        Spain    Male   44
11       Spain    Male   24
14       Spain  Female   35
...        ...     ...  ...
9966     Spain    Male   35
9980     Spain    Male   35
9987     Spain    Male   30
9989     Spain    Male   28
9992     Spain    Male   36

[2477 rows x 3 columns]

In [91]:
df_small.loc[9992]

Geography    Spain
Gender        Male
Age             36
Name: 9992, dtype: object

In [92]:
df_small.loc[[1, 4, 5], ['Gender', 'Age']]

   Gender  Age
1  Female   41
4  Female   43
5    Male   44

In [93]:
df_small

     Geography  Gender  Age
1        Spain  Female   41
4        Spain  Female   43
5        Spain    Male   44
11       Spain    Male   24
14       Spain  Female   35
...        ...     ...  ...
9966     Spain    Male   35
9980     Spain    Male   35
9987     Spain    Male   30
9989     Spain    Male   28
9992     Spain    Male   36

[2477 rows x 3 columns]

In [94]:
df.sort_values('Age')

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
3512,3513,15657779,Boylan,806,Spain,Male,18,3,0.00,2,True,1,86994.54,0
1678,1679,15569178,Kharlamov,570,France,Female,18,4,82767.42,1,True,0,71811.90,0
3517,3518,15757821,Burgess,771,Spain,Male,18,1,0.00,2,False,0,41542.95,0
9520,9521,15673180,Onyekaozulu,727,Germany,Female,18,2,93816.70,2,True,0,126172.11,0
2021,2022,15795519,Vasiliev,716,Germany,Female,18,3,128743.80,1,False,0,197322.13,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3387,3388,15798024,Lori,537,Germany,Male,84,8,92242.34,1,True,1,186235.98,0
3033,3034,15578006,Yao,787,France,Female,85,10,0.00,2,True,1,116537.96,0
2458,2459,15813303,Rearick,513,Spain,Male,88,10,0.00,2,True,1,52952.24,0
6759,6760,15660878,T'ien,705,France,Male,92,1,126076.24,2,True,1,34436.83,0
6443,6444,15764927,Rogova,753,France,Male,92,3,121513.31,1,False,1,195563.99,0